tutorials/pimpleHFDIBFoam/Immersed_Cyl_Static/Cyl_Immersed_New/ImmersedCyl-Static-Re20-Mesh5000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1;

// ==========================================================
// Graded rectangular mesh
// Refined near centre
// Coarser near inlet/outlet and top/bottom
//
// Approx total CVs ~ 5000
//
// Nx = 14 + 20 + 32 + 20 + 14 = 100
// Ny = 12 + 26 + 12 = 50
// Nz = 1
//
// Total = 100 * 50 * 1 = 5000
// ==========================================================

vertices
(
    // z = -0.05
    (0    0    -0.05) // 0
    (6    0    -0.05) // 1
    (10   0    -0.05) // 2
    (14   0    -0.05) // 3
    (18   0    -0.05) // 4
    (24   0    -0.05) // 5

    (0    1    -0.05) // 6
    (6    1    -0.05) // 7
    (10   1    -0.05) // 8
    (14   1    -0.05) // 9
    (18   1    -0.05) // 10
    (24   1    -0.05) // 11

    (0    3.1  -0.05) // 12
    (6    3.1  -0.05) // 13
    (10   3.1  -0.05) // 14
    (14   3.1  -0.05) // 15
    (18   3.1  -0.05) // 16
    (24   3.1  -0.05) // 17

    (0    4.1  -0.05) // 18
    (6    4.1  -0.05) // 19
    (10   4.1  -0.05) // 20
    (14   4.1  -0.05) // 21
    (18   4.1  -0.05) // 22
    (24   4.1  -0.05) // 23

    // z = +0.05
    (0    0     0.05) // 24
    (6    0     0.05) // 25
    (10   0     0.05) // 26
    (14   0     0.05) // 27
    (18   0     0.05) // 28
    (24   0     0.05) // 29

    (0    1     0.05) // 30
    (6    1     0.05) // 31
    (10   1     0.05) // 32
    (14   1     0.05) // 33
    (18   1     0.05) // 34
    (24   1     0.05) // 35

    (0    3.1   0.05) // 36
    (6    3.1   0.05) // 37
    (10   3.1   0.05) // 38
    (14   3.1   0.05) // 39
    (18   3.1   0.05) // 40
    (24   3.1   0.05) // 41

    (0    4.1   0.05) // 42
    (6    4.1   0.05) // 43
    (10   4.1   0.05) // 44
    (14   4.1   0.05) // 45
    (18   4.1   0.05) // 46
    (24   4.1   0.05) // 47
);

blocks
(
    // ======================================================
    // Bottom band
    // ======================================================

    hex (0 1 7 6 24 25 31 30)      (14 12 1) simpleGrading (0.25 1 1)
    hex (1 2 8 7 25 26 32 31)      (20 12 1) simpleGrading (0.50 1 1)
    hex (2 3 9 8 26 27 33 32)      (32 12 1) simpleGrading (1    1 1)
    hex (3 4 10 9 27 28 34 33)     (20 12 1) simpleGrading (2    1 1)
    hex (4 5 11 10 28 29 35 34)    (14 12 1) simpleGrading (4    1 1)

    // ======================================================
    // Middle band
    // ======================================================

    hex (6 7 13 12 30 31 37 36)    (14 26 1) simpleGrading (0.25 1 1)
    hex (7 8 14 13 31 32 38 37)    (20 26 1) simpleGrading (0.50 1 1)
    hex (8 9 15 14 32 33 39 38)    (32 26 1) simpleGrading (1    1 1)
    hex (9 10 16 15 33 34 40 39)   (20 26 1) simpleGrading (2    1 1)
    hex (10 11 17 16 34 35 41 40)  (14 26 1) simpleGrading (4    1 1)

    // ======================================================
    // Top band
    // ======================================================

    hex (12 13 19 18 36 37 43 42)  (14 12 1) simpleGrading (0.25 1 1)
    hex (13 14 20 19 37 38 44 43)  (20 12 1) simpleGrading (0.50 1 1)
    hex (14 15 21 20 38 39 45 44)  (32 12 1) simpleGrading (1    1 1)
    hex (15 16 22 21 39 40 46 45)  (20 12 1) simpleGrading (2    1 1)
    hex (16 17 23 22 40 41 47 46)  (14 12 1) simpleGrading (4    1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 30 24)
            (6 12 36 30)
            (12 18 42 36)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (5 11 35 29)
            (11 17 41 35)
            (17 23 47 41)
        );
    }

    bottomWall
    {
        type wall;
        faces
        (
            (0 1 25 24)
            (1 2 26 25)
            (2 3 27 26)
            (3 4 28 27)
            (4 5 29 28)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (18 19 43 42)
            (19 20 44 43)
            (20 21 45 44)
            (21 22 46 45)
            (22 23 47 46)
        );
    }

    frontAndBackPlanes
    {
        type empty;

        faces
        (
            (0 1 7 6)
            (1 2 8 7)
            (2 3 9 8)
            (3 4 10 9)
            (4 5 11 10)

            (6 7 13 12)
            (7 8 14 13)
            (8 9 15 14)
            (9 10 16 15)
            (10 11 17 16)

            (12 13 19 18)
            (13 14 20 19)
            (14 15 21 20)
            (15 16 22 21)
            (16 17 23 22)

            (24 25 31 30)
            (25 26 32 31)
            (26 27 33 32)
            (27 28 34 33)
            (28 29 35 34)

            (30 31 37 36)
            (31 32 38 37)
            (32 33 39 38)
            (33 34 40 39)
            (34 35 41 40)

            (36 37 43 42)
            (37 38 44 43)
            (38 39 45 44)
            (39 40 46 45)
            (40 41 47 46)
        );
    }
);

mergePatchPairs();
